; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=405, out_folder=htg/blocksworld/training, instance_id=95, seed=2119, goal_proportion=0.03

(define (problem blocksworld-95)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 b379 b380 b381 b382 b383 b384 b385 b386 b387 b388 b389 b390 b391 b392 b393 b394 b395 b396 b397 b398 b399 b400 b401 b402 b403 b404 b405 - object)
 (:init 
    (arm-empty)
    (clear b295)
    (on b295 b324)
    (on b324 b357)
    (on b357 b252)
    (on-table b252)
    (clear b24)
    (on b24 b108)
    (on b108 b175)
    (on b175 b315)
    (on b315 b48)
    (on b48 b282)
    (on b282 b95)
    (on-table b95)
    (clear b193)
    (on b193 b127)
    (on b127 b383)
    (on-table b383)
    (clear b379)
    (on-table b379)
    (clear b194)
    (on b194 b182)
    (on b182 b293)
    (on b293 b340)
    (on b340 b233)
    (on-table b233)
    (clear b401)
    (on-table b401)
    (clear b158)
    (on b158 b14)
    (on-table b14)
    (clear b362)
    (on b362 b350)
    (on b350 b273)
    (on b273 b161)
    (on-table b161)
    (clear b186)
    (on-table b186)
    (clear b251)
    (on b251 b167)
    (on b167 b283)
    (on-table b283)
    (clear b76)
    (on b76 b300)
    (on b300 b16)
    (on b16 b320)
    (on-table b320)
    (clear b84)
    (on b84 b319)
    (on b319 b191)
    (on b191 b179)
    (on b179 b284)
    (on b284 b33)
    (on b33 b353)
    (on b353 b239)
    (on b239 b274)
    (on b274 b47)
    (on b47 b348)
    (on b348 b30)
    (on b30 b99)
    (on-table b99)
    (clear b184)
    (on b184 b159)
    (on b159 b140)
    (on-table b140)
    (clear b104)
    (on b104 b328)
    (on b328 b153)
    (on b153 b312)
    (on b312 b342)
    (on b342 b309)
    (on-table b309)
    (clear b50)
    (on b50 b330)
    (on-table b330)
    (clear b276)
    (on b276 b391)
    (on b391 b19)
    (on b19 b45)
    (on b45 b23)
    (on-table b23)
    (clear b40)
    (on b40 b130)
    (on b130 b221)
    (on b221 b255)
    (on b255 b336)
    (on b336 b301)
    (on b301 b218)
    (on b218 b138)
    (on b138 b271)
    (on-table b271)
    (clear b373)
    (on b373 b116)
    (on-table b116)
    (clear b73)
    (on b73 b208)
    (on b208 b323)
    (on b323 b211)
    (on b211 b260)
    (on-table b260)
    (clear b368)
    (on b368 b129)
    (on-table b129)
    (clear b360)
    (on b360 b174)
    (on b174 b38)
    (on b38 b35)
    (on-table b35)
    (clear b71)
    (on b71 b111)
    (on b111 b369)
    (on b369 b133)
    (on b133 b137)
    (on-table b137)
    (clear b8)
    (on b8 b115)
    (on-table b115)
    (clear b264)
    (on b264 b162)
    (on b162 b97)
    (on b97 b128)
    (on b128 b217)
    (on b217 b242)
    (on-table b242)
    (clear b88)
    (on b88 b70)
    (on-table b70)
    (clear b200)
    (on b200 b347)
    (on b347 b288)
    (on b288 b43)
    (on b43 b397)
    (on-table b397)
    (clear b96)
    (on-table b96)
    (clear b123)
    (on b123 b222)
    (on-table b222)
    (clear b380)
    (on b380 b10)
    (on b10 b317)
    (on b317 b296)
    (on b296 b57)
    (on-table b57)
    (clear b393)
    (on b393 b180)
    (on b180 b247)
    (on b247 b36)
    (on b36 b109)
    (on b109 b351)
    (on b351 b277)
    (on b277 b141)
    (on b141 b313)
    (on b313 b327)
    (on b327 b172)
    (on b172 b120)
    (on-table b120)
    (clear b372)
    (on b372 b268)
    (on-table b268)
    (clear b272)
    (on-table b272)
    (clear b248)
    (on b248 b52)
    (on-table b52)
    (clear b392)
    (on b392 b378)
    (on b378 b160)
    (on-table b160)
    (clear b154)
    (on-table b154)
    (clear b12)
    (on b12 b321)
    (on b321 b232)
    (on-table b232)
    (clear b238)
    (on-table b238)
    (clear b65)
    (on b65 b136)
    (on b136 b32)
    (on b32 b62)
    (on-table b62)
    (clear b388)
    (on b388 b256)
    (on b256 b185)
    (on b185 b55)
    (on b55 b236)
    (on b236 b173)
    (on b173 b212)
    (on-table b212)
    (clear b146)
    (on-table b146)
    (clear b28)
    (on b28 b230)
    (on-table b230)
    (clear b249)
    (on b249 b402)
    (on b402 b69)
    (on b69 b63)
    (on-table b63)
    (clear b126)
    (on-table b126)
    (clear b53)
    (on b53 b39)
    (on b39 b261)
    (on b261 b385)
    (on b385 b334)
    (on-table b334)
    (clear b90)
    (on-table b90)
    (clear b303)
    (on b303 b3)
    (on b3 b367)
    (on-table b367)
    (clear b345)
    (on b345 b157)
    (on-table b157)
    (clear b93)
    (on-table b93)
    (clear b82)
    (on b82 b389)
    (on-table b389)
    (clear b318)
    (on b318 b197)
    (on b197 b18)
    (on b18 b209)
    (on-table b209)
    (clear b110)
    (on b110 b289)
    (on b289 b302)
    (on b302 b304)
    (on b304 b61)
    (on b61 b87)
    (on-table b87)
    (clear b294)
    (on b294 b148)
    (on-table b148)
    (clear b308)
    (on b308 b331)
    (on b331 b337)
    (on b337 b266)
    (on b266 b396)
    (on b396 b204)
    (on b204 b253)
    (on b253 b6)
    (on-table b6)
    (clear b181)
    (on b181 b78)
    (on b78 b285)
    (on-table b285)
    (clear b214)
    (on b214 b142)
    (on b142 b344)
    (on-table b344)
    (clear b386)
    (on b386 b201)
    (on b201 b213)
    (on b213 b151)
    (on-table b151)
    (clear b364)
    (on b364 b235)
    (on-table b235)
    (clear b26)
    (on b26 b219)
    (on b219 b121)
    (on b121 b237)
    (on b237 b117)
    (on b117 b34)
    (on-table b34)
    (clear b106)
    (on-table b106)
    (clear b310)
    (on b310 b105)
    (on b105 b306)
    (on b306 b307)
    (on b307 b94)
    (on b94 b258)
    (on b258 b311)
    (on b311 b382)
    (on b382 b150)
    (on-table b150)
    (clear b21)
    (on b21 b405)
    (on b405 b147)
    (on b147 b86)
    (on-table b86)
    (clear b139)
    (on b139 b398)
    (on b398 b168)
    (on b168 b265)
    (on b265 b59)
    (on b59 b400)
    (on-table b400)
    (clear b166)
    (on b166 b224)
    (on b224 b1)
    (on b1 b203)
    (on-table b203)
    (clear b267)
    (on b267 b145)
    (on b145 b361)
    (on b361 b77)
    (on b77 b341)
    (on-table b341)
    (clear b75)
    (on b75 b202)
    (on b202 b102)
    (on b102 b363)
    (on b363 b231)
    (on b231 b98)
    (on b98 b352)
    (on-table b352)
    (clear b113)
    (on b113 b134)
    (on b134 b42)
    (on-table b42)
    (clear b114)
    (on b114 b297)
    (on b297 b37)
    (on b37 b291)
    (on b291 b107)
    (on-table b107)
    (clear b124)
    (on b124 b206)
    (on b206 b122)
    (on-table b122)
    (clear b374)
    (on-table b374)
    (clear b226)
    (on b226 b329)
    (on b329 b355)
    (on b355 b278)
    (on b278 b49)
    (on b49 b343)
    (on-table b343)
    (clear b305)
    (on b305 b164)
    (on b164 b20)
    (on b20 b56)
    (on-table b56)
    (clear b262)
    (on-table b262)
    (clear b149)
    (on b149 b101)
    (on b101 b188)
    (on b188 b326)
    (on b326 b199)
    (on b199 b394)
    (on b394 b316)
    (on-table b316)
    (clear b339)
    (on-table b339)
    (clear b29)
    (on-table b29)
    (clear b216)
    (on-table b216)
    (clear b234)
    (on-table b234)
    (clear b81)
    (on b81 b215)
    (on b215 b132)
    (on b132 b346)
    (on-table b346)
    (clear b119)
    (on b119 b228)
    (on-table b228)
    (clear b359)
    (on b359 b165)
    (on-table b165)
    (clear b152)
    (on-table b152)
    (clear b290)
    (on b290 b198)
    (on b198 b64)
    (on b64 b223)
    (on b223 b79)
    (on b79 b41)
    (on b41 b58)
    (on b58 b335)
    (on b335 b322)
    (on-table b322)
    (clear b103)
    (on b103 b205)
    (on-table b205)
    (clear b189)
    (on b189 b7)
    (on b7 b118)
    (on-table b118)
    (clear b183)
    (on b183 b11)
    (on b11 b299)
    (on-table b299)
    (clear b60)
    (on-table b60)
    (clear b390)
    (on b390 b332)
    (on-table b332)
    (clear b83)
    (on b83 b169)
    (on b169 b195)
    (on b195 b286)
    (on b286 b51)
    (on b51 b15)
    (on b15 b68)
    (on b68 b80)
    (on b80 b220)
    (on b220 b241)
    (on-table b241)
    (clear b371)
    (on-table b371)
    (clear b270)
    (on b270 b85)
    (on b85 b243)
    (on b243 b44)
    (on-table b44)
    (clear b257)
    (on-table b257)
    (clear b279)
    (on-table b279)
    (clear b281)
    (on-table b281)
    (clear b269)
    (on-table b269)
    (clear b196)
    (on b196 b384)
    (on-table b384)
    (clear b254)
    (on-table b254)
    (clear b54)
    (on b54 b387)
    (on-table b387)
    (clear b325)
    (on b325 b192)
    (on b192 b207)
    (on-table b207)
    (clear b356)
    (on b356 b229)
    (on b229 b187)
    (on b187 b338)
    (on b338 b144)
    (on-table b144)
    (clear b156)
    (on b156 b358)
    (on-table b358)
    (clear b245)
    (on b245 b177)
    (on b177 b178)
    (on-table b178)
    (clear b92)
    (on b92 b100)
    (on b100 b13)
    (on b13 b287)
    (on b287 b66)
    (on b66 b170)
    (on-table b170)
    (clear b135)
    (on b135 b280)
    (on b280 b377)
    (on b377 b176)
    (on b176 b74)
    (on b74 b225)
    (on-table b225)
    (clear b163)
    (on b163 b403)
    (on-table b403)
    (clear b399)
    (on b399 b246)
    (on b246 b240)
    (on b240 b25)
    (on b25 b171)
    (on b171 b125)
    (on b125 b46)
    (on b46 b5)
    (on b5 b365)
    (on b365 b404)
    (on b404 b259)
    (on b259 b89)
    (on b89 b17)
    (on-table b17)
    (clear b67)
    (on b67 b4)
    (on b4 b370)
    (on b370 b22)
    (on b22 b275)
    (on-table b275)
    (clear b190)
    (on b190 b244)
    (on b244 b72)
    (on b72 b9)
    (on-table b9)
    (clear b298)
    (on b298 b354)
    (on b354 b381)
    (on b381 b155)
    (on b155 b131)
    (on b131 b366)
    (on-table b366)
    (clear b227)
    (on-table b227)
    (clear b210)
    (on b210 b27)
    (on-table b27)
    (clear b31)
    (on b31 b375)
    (on b375 b112)
    (on-table b112)
    (clear b250)
    (on b250 b263)
    (on b263 b314)
    (on b314 b333)
    (on b333 b349)
    (on b349 b395)
    (on b395 b2)
    (on-table b2)
    (clear b376)
    (on b376 b292)
    (on-table b292)
    (clear b143)
    (on b143 b91)
    (on-table b91))
 (:goal  (and 
    (clear b8)
    (on b8 b7)
    (on b7 b5)
    (on-table b5)
    (clear b12)
    (on b12 b4)
    (on b4 b11)
    (on b11 b9)
    (on b9 b10)
    (on b10 b3)
    (on b3 b2)
    (on b2 b6)
    (on-table b6)
    (clear b1)
    (on-table b1))))

; plan
1. (unstack b166 b224)
   deleted: (on b166 b224) (clear b166) (arm-empty)
   added: (holding b166) (clear b224)
   goals met: 3 of 15
2. (putdown b166)
   deleted: (holding b166)
   added: (clear b166) (arm-empty) (on-table b166)
   goals met: 3 of 15
3. (unstack b183 b11)
   deleted: (on b183 b11) (clear b183) (arm-empty)
   added: (holding b183) (clear b11)
   goals met: 3 of 15
4. (putdown b183)
   deleted: (holding b183)
   added: (clear b183) (arm-empty) (on-table b183)
   goals met: 3 of 15
5. (unstack b189 b7)
   deleted: (on b189 b7) (clear b189) (arm-empty)
   added: (holding b189) (clear b7)
   goals met: 3 of 15
6. (putdown b189)
   deleted: (holding b189)
   added: (clear b189) (arm-empty) (on-table b189)
   goals met: 3 of 15
7. (unstack b190 b244)
   deleted: (on b190 b244) (clear b190) (arm-empty)
   added: (holding b190) (clear b244)
   goals met: 3 of 15
8. (putdown b190)
   deleted: (holding b190)
   added: (clear b190) (arm-empty) (on-table b190)
   goals met: 3 of 15
9. (unstack b224 b1)
   deleted: (on b224 b1) (clear b224) (arm-empty)
   added: (holding b224) (clear b1)
   goals met: 4 of 15
10. (putdown b224)
   deleted: (holding b224)
   added: (clear b224) (arm-empty) (on-table b224)
   goals met: 4 of 15
11. (unstack b1 b203)
   deleted: (on b1 b203) (clear b1) (arm-empty)
   added: (holding b1) (clear b203)
   goals met: 3 of 15
12. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 5 of 15
13. (unstack b244 b72)
   deleted: (on b244 b72) (clear b244) (arm-empty)
   added: (holding b244) (clear b72)
   goals met: 5 of 15
14. (putdown b244)
   deleted: (holding b244)
   added: (clear b244) (arm-empty) (on-table b244)
   goals met: 5 of 15
15. (unstack b250 b263)
   deleted: (on b250 b263) (clear b250) (arm-empty)
   added: (holding b250) (clear b263)
   goals met: 5 of 15
16. (putdown b250)
   deleted: (holding b250)
   added: (clear b250) (arm-empty) (on-table b250)
   goals met: 5 of 15
17. (unstack b263 b314)
   deleted: (on b263 b314) (clear b263) (arm-empty)
   added: (holding b263) (clear b314)
   goals met: 5 of 15
18. (putdown b263)
   deleted: (holding b263)
   added: (clear b263) (arm-empty) (on-table b263)
   goals met: 5 of 15
19. (unstack b303 b3)
   deleted: (on b303 b3) (clear b303) (arm-empty)
   added: (holding b303) (clear b3)
   goals met: 5 of 15
20. (putdown b303)
   deleted: (holding b303)
   added: (clear b303) (arm-empty) (on-table b303)
   goals met: 5 of 15
21. (unstack b308 b331)
   deleted: (on b308 b331) (clear b308) (arm-empty)
   added: (holding b308) (clear b331)
   goals met: 5 of 15
22. (putdown b308)
   deleted: (holding b308)
   added: (clear b308) (arm-empty) (on-table b308)
   goals met: 5 of 15
23. (unstack b314 b333)
   deleted: (on b314 b333) (clear b314) (arm-empty)
   added: (holding b314) (clear b333)
   goals met: 5 of 15
24. (putdown b314)
   deleted: (holding b314)
   added: (clear b314) (arm-empty) (on-table b314)
   goals met: 5 of 15
25. (unstack b331 b337)
   deleted: (on b331 b337) (clear b331) (arm-empty)
   added: (holding b331) (clear b337)
   goals met: 5 of 15
26. (putdown b331)
   deleted: (holding b331)
   added: (clear b331) (arm-empty) (on-table b331)
   goals met: 5 of 15
27. (unstack b333 b349)
   deleted: (on b333 b349) (clear b333) (arm-empty)
   added: (holding b333) (clear b349)
   goals met: 5 of 15
28. (putdown b333)
   deleted: (holding b333)
   added: (clear b333) (arm-empty) (on-table b333)
   goals met: 5 of 15
29. (unstack b337 b266)
   deleted: (on b337 b266) (clear b337) (arm-empty)
   added: (holding b337) (clear b266)
   goals met: 5 of 15
30. (putdown b337)
   deleted: (holding b337)
   added: (clear b337) (arm-empty) (on-table b337)
   goals met: 5 of 15
31. (unstack b266 b396)
   deleted: (on b266 b396) (clear b266) (arm-empty)
   added: (holding b266) (clear b396)
   goals met: 5 of 15
32. (putdown b266)
   deleted: (holding b266)
   added: (clear b266) (arm-empty) (on-table b266)
   goals met: 5 of 15
33. (unstack b349 b395)
   deleted: (on b349 b395) (clear b349) (arm-empty)
   added: (holding b349) (clear b395)
   goals met: 5 of 15
34. (putdown b349)
   deleted: (holding b349)
   added: (clear b349) (arm-empty) (on-table b349)
   goals met: 5 of 15
35. (unstack b380 b10)
   deleted: (on b380 b10) (clear b380) (arm-empty)
   added: (holding b380) (clear b10)
   goals met: 5 of 15
36. (putdown b380)
   deleted: (holding b380)
   added: (clear b380) (arm-empty) (on-table b380)
   goals met: 5 of 15
37. (unstack b395 b2)
   deleted: (on b395 b2) (clear b395) (arm-empty)
   added: (holding b395) (clear b2)
   goals met: 5 of 15
38. (putdown b395)
   deleted: (holding b395)
   added: (clear b395) (arm-empty) (on-table b395)
   goals met: 5 of 15
39. (unstack b396 b204)
   deleted: (on b396 b204) (clear b396) (arm-empty)
   added: (holding b396) (clear b204)
   goals met: 5 of 15
40. (putdown b396)
   deleted: (holding b396)
   added: (clear b396) (arm-empty) (on-table b396)
   goals met: 5 of 15
41. (unstack b204 b253)
   deleted: (on b204 b253) (clear b204) (arm-empty)
   added: (holding b204) (clear b253)
   goals met: 5 of 15
42. (putdown b204)
   deleted: (holding b204)
   added: (clear b204) (arm-empty) (on-table b204)
   goals met: 5 of 15
43. (unstack b253 b6)
   deleted: (on b253 b6) (clear b253) (arm-empty)
   added: (holding b253) (clear b6)
   goals met: 5 of 15
44. (putdown b253)
   deleted: (holding b253)
   added: (clear b253) (arm-empty) (on-table b253)
   goals met: 5 of 15
45. (unstack b399 b246)
   deleted: (on b399 b246) (clear b399) (arm-empty)
   added: (holding b399) (clear b246)
   goals met: 5 of 15
46. (putdown b399)
   deleted: (holding b399)
   added: (clear b399) (arm-empty) (on-table b399)
   goals met: 5 of 15
47. (unstack b246 b240)
   deleted: (on b246 b240) (clear b246) (arm-empty)
   added: (holding b246) (clear b240)
   goals met: 5 of 15
48. (putdown b246)
   deleted: (holding b246)
   added: (clear b246) (arm-empty) (on-table b246)
   goals met: 5 of 15
49. (unstack b240 b25)
   deleted: (on b240 b25) (clear b240) (arm-empty)
   added: (holding b240) (clear b25)
   goals met: 5 of 15
50. (putdown b240)
   deleted: (holding b240)
   added: (clear b240) (arm-empty) (on-table b240)
   goals met: 5 of 15
51. (unstack b25 b171)
   deleted: (on b25 b171) (clear b25) (arm-empty)
   added: (holding b25) (clear b171)
   goals met: 5 of 15
52. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 5 of 15
53. (unstack b171 b125)
   deleted: (on b171 b125) (clear b171) (arm-empty)
   added: (holding b171) (clear b125)
   goals met: 5 of 15
54. (putdown b171)
   deleted: (holding b171)
   added: (clear b171) (arm-empty) (on-table b171)
   goals met: 5 of 15
55. (unstack b125 b46)
   deleted: (on b125 b46) (clear b125) (arm-empty)
   added: (holding b125) (clear b46)
   goals met: 5 of 15
56. (putdown b125)
   deleted: (holding b125)
   added: (clear b125) (arm-empty) (on-table b125)
   goals met: 5 of 15
57. (unstack b46 b5)
   deleted: (on b46 b5) (clear b46) (arm-empty)
   added: (holding b46) (clear b5)
   goals met: 5 of 15
58. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 5 of 15
59. (unstack b5 b365)
   deleted: (on b5 b365) (clear b5) (arm-empty)
   added: (holding b5) (clear b365)
   goals met: 5 of 15
60. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 6 of 15
61. (unstack b67 b4)
   deleted: (on b67 b4) (clear b67) (arm-empty)
   added: (holding b67) (clear b4)
   goals met: 6 of 15
62. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 6 of 15
63. (unstack b72 b9)
   deleted: (on b72 b9) (clear b72) (arm-empty)
   added: (holding b72) (clear b9)
   goals met: 6 of 15
64. (putdown b72)
   deleted: (holding b72)
   added: (clear b72) (arm-empty) (on-table b72)
   goals met: 6 of 15
65. (unstack b10 b317)
   deleted: (on b10 b317) (clear b10) (arm-empty)
   added: (holding b10) (clear b317)
   goals met: 6 of 15
66. (stack b10 b3)
   deleted: (clear b3) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b3)
   goals met: 7 of 15
67. (unstack b11 b299)
   deleted: (on b11 b299) (clear b11) (arm-empty)
   added: (holding b11) (clear b299)
   goals met: 7 of 15
68. (stack b11 b9)
   deleted: (clear b9) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b9)
   goals met: 8 of 15
69. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 8 of 15
70. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 9 of 15
71. (unstack b4 b370)
   deleted: (on b4 b370) (clear b4) (arm-empty)
   added: (holding b4) (clear b370)
   goals met: 9 of 15
72. (stack b4 b11)
   deleted: (clear b11) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b11)
   goals met: 10 of 15
73. (unstack b7 b118)
   deleted: (on b7 b118) (clear b7) (arm-empty)
   added: (holding b7) (clear b118)
   goals met: 10 of 15
74. (stack b7 b5)
   deleted: (clear b5) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b5)
   goals met: 11 of 15
75. (unstack b12 b321)
   deleted: (on b12 b321) (clear b12) (arm-empty)
   added: (holding b12) (clear b321)
   goals met: 10 of 15
76. (stack b12 b4)
   deleted: (clear b4) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b4)
   goals met: 12 of 15
77. (unstack b8 b115)
   deleted: (on b8 b115) (clear b8) (arm-empty)
   added: (holding b8) (clear b115)
   goals met: 11 of 15
78. (stack b8 b7)
   deleted: (clear b7) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b7)
   goals met: 13 of 15
79. (unstack b10 b3)
   deleted: (on b10 b3) (clear b10) (arm-empty)
   added: (holding b10) (clear b3)
   goals met: 12 of 15
80. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 12 of 15
81. (unstack b3 b367)
   deleted: (on b3 b367) (clear b3) (arm-empty)
   added: (holding b3) (clear b367)
   goals met: 12 of 15
82. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 13 of 15
83. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 13 of 15
84. (stack b10 b3)
   deleted: (clear b3) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b3)
   goals met: 14 of 15
85. (unstack b12 b4)
   deleted: (on b12 b4) (clear b12) (arm-empty)
   added: (holding b12) (clear b4)
   goals met: 12 of 15
86. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 13 of 15
87. (unstack b4 b11)
   deleted: (on b4 b11) (clear b4) (arm-empty)
   added: (holding b4) (clear b11)
   goals met: 12 of 15
88. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 12 of 15
89. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 11 of 15
90. (stack b12 b4)
   deleted: (clear b4) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b4)
   goals met: 13 of 15
91. (unstack b11 b9)
   deleted: (on b11 b9) (clear b11) (arm-empty)
   added: (holding b11) (clear b9)
   goals met: 12 of 15
92. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 12 of 15
93. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 12 of 15
94. (stack b9 b10)
   deleted: (clear b10) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b10)
   goals met: 13 of 15
95. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 13 of 15
96. (stack b11 b9)
   deleted: (clear b9) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b9)
   goals met: 14 of 15
97. (unstack b12 b4)
   deleted: (on b12 b4) (clear b12) (arm-empty)
   added: (holding b12) (clear b4)
   goals met: 12 of 15
98. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 13 of 15
99. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 13 of 15
100. (stack b4 b11)
   deleted: (clear b11) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b11)
   goals met: 14 of 15
101. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 13 of 15
102. (stack b12 b4)
   deleted: (clear b4) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b4)
   goals met: 15 of 15
